artillery_tests/socket_insert_load_test.yaml
config:
  target: "http://localhost"
  phases:
    - duration: 120
      arrivalRate: 50
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "sendChange"
          data: "{\"action\":\"insert\",\"positionStart\":{\"row\":0,\"column\":0},\"content\":[\"Hello World\", \"\"],\"positionEnd\":{\"row\":0,\"column\":1}}"
          namespace: "/collab"